# IsLSByClass

## Description
Function IsLSByClass returns whether a class line style is used for the referenced object.

```pascal
FUNCTION IsLSByClass(h : HANDLE): BOOLEAN;
```

```python
def vs.IsLSByClass(h):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|Handle to object.|

## Remarks
Returns an indication of whether the class line style is used for the object referenced by h.
[sd 8/19/98]

## Version
Availability: from VectorWorks8.0

## Category
* Object Attributes